
#if 0

状态不好, 成迷于踢球中, 最近欠账有点多

1 > 二叉树的链式存储结构
2 > Linux的进程概念
3 > 今天C++开篇了, 我准备乘早下手, 先写一会, 要么改天又要拖了, 越拖越多

也没有办法, 好像就是因为太懒惰了, 先写一点吧, 能写一点是一点



C语言之父   丹尼斯里奇
C++之父     本贾尼.斯特劳斯特鲁普(简称本贾尼)


(其实最近打字准确率有所上升, 对键盘的熟练度也在增加, vim有点太好用, 感觉越来越像程序员...)


(Linux 上的代码补全得赶紧弄了, 否则太麻烦)


(这周还要回家, 事情好多, 明天下午也去上不了课, 意味着我得补课了...)

任何情况面试官问我C语言有多少个关键字的时候, 我应该说的是, 在某某标准下, 准确的说ANSI c 标准下有32个关键字

之前我是不知道ANSI C到底是个什么标准的

ANSI C是由美国国家标准协会（ANSI）及国际标准化组织（ISO）推出的关于C语言的标准 ANSI C、ISO C、C89、C90其实是同一种标准。

C 语言可以像汇编语言一样对位、字节和地址进行操作，而这三者是计算机最基本的工作单元。

这句话是我复制的, 发现了一个计算机最基本单元对知识点, 位, 字节, 地址进行操作,


关键字(63个关键字目前来说)



命名空间(using namespace;)
C++语言有命名冲突 为了避免命名冲突 才有了命名空间这一说法C98 提出的这个东西

C++输入输出


缺省参数


函数重载







#endif
